/* Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, 
какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3 */

/*Console.WriteLine("Введите первое цельное число"); // Просим пользователя ввести первое число
int number1 = Convert.ToInt32(Console.ReadLine()); // объявляем переменную и сохраняем значение ввёденное пользователем
Console.WriteLine("Введите второе цельное число"); // Просим пользователя ввести второе число
int number2 = Convert.ToInt32(Console.ReadLine()); //объявляем ещё одну переменную и сохраняем значение ввёденное пользователем

if(number1 > number2) // добавляем условие, которое поможет определить какое из чисел максимальное
{
    Console.WriteLine("максимальное число " + number1); // если первое число больше второго, то максимальным числом является первое
}
else {
    Console.WriteLine("максимальное число " + number2); // если первое число меньше второго, то максимальным числом является второе 
}*/

/* Задача 4: Напишите программу, которая 
принимает на вход три числа и 
выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22*/

/*int number1 = 22; // объявлем первую переменную и присваиваем ей значение 22
int number2 = 3;  // объявлем вторую переменную и присваиваем ей значение 3
int number3 = 9; // объявлем третью переменную и присваиваем ей значение 9

int max = number1; // объявляем переменную max и присвоем ей значение number1

if(number2 > max) // Добавляем условие, которое сравнит значение второй переменной с переменной max, если number2 больше max, то меняем значение переменной max
{
    max = number2;
}
if(number3 > max) // Добавляем условие, которое сравнит значение третьей переменной с переменной max, если number3 больше max, то меняем значение переменной max
{
    max = number3;
}

Console.WriteLine("максимальное число " + max); // выводим значение max на экран*/

/* Задача 6: Напишите программу, 
которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет */

/*Console.WriteLine("Введите целое число"); // Просим пользователя ввести целое число
int num = Convert.ToInt32(Console.ReadLine()); // Объявляем переменную num и записываем в неё значение введённое пользователем


if(num % 2 == 0) // Объявляем условие: если число делится на 2 без остатка(остаток равен 0), то число чётное, если нет, то число не чётное
{
    Console.WriteLine("Число является чётным");
}
else 
{
    Console.WriteLine("Число является не чётным");
} */

/* Задача 8: Напишите программу, 
которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8 */

/* Console.WriteLine("Введите целое число"); // Просим пользователя ввести целое число
int N = Convert.ToInt32(Console.ReadLine()); // Объявляем переменную N и записываем в неё значение введённое пользователем

for (int i = 1; i <= N; i++ ) // Запускаем цикл for. В теле цикла объявим новую перемtнную i и присвоим её значение 1 (так нам нужен промежуток от 1 до N). Добавляем условие, что пока i меньше или равно N, будем увеличивать i на 1
{
    if(i % 2 == 0) // Добваим ещё одно условие, которое будет прверять чётное число или нет (если остаток от деление на 2 будет равен нулю). Если чётное то выводим его на экран
    {
        Console.Write(i+", " ); // Выводим значение i через запятую
    }
} */

