/* Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, 
какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3 */

/*Console.WriteLine("Введите первое цельное число"); // Просим пользователя ввести первое число
int number1 = Convert.ToInt32(Console.ReadLine()); // обьявляем переменную и сохраняем значение ввёденное пользователем
Console.WriteLine("Введите второе цельное число"); // Просим пользователя ввести второе число
int number2 = Convert.ToInt32(Console.ReadLine()); //обьявляем ещё одну переменную и сохраняем значение ввёденное пользователем

if(number1 > number2) // добовляем условие, которое поможет определить какое из чисел максимальное
{
    Console.WriteLine("максимальное число " + number1); // если первое число больше второго, то максимальным числом является первое
}
else {
    Console.WriteLine("максимальное число " + number2); // если первое число меньше второго, то максимальным числом является второе 
}*/

/* Задача 4: Напишите программу, которая 
принимает на вход три числа и 
выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22*/

/*int number1 = 22; // обьявлем первую переменную и присваиваем ей значение 22
int number2 = 3;  // обьявлем вторую переменную и присваиваем ей значение 3
int number3 = 9; // обьявлем третью переменную и присваиваем ей значение 9

int max = number1; // обьявляем переменную max и присвоем ей значение number1

if(number2 > max) // Добавляем условие, которое сравнит значение второй переменной с переменной max, если number2 больше max, то меняем значение переменной max
{
    max = number2;
}
if(number3 > max) // Добавляем условие, которое сравнит значение третьей переменной с переменной max, если number3 больше max, то меняем значение переменной max
{
    max = number3;
}

Console.WriteLine("максимальное число " + max); // выводим значение max на экран*/

